wgtdkp/openthread/examples/platforms/nrf528xx/src/toble.c
/*
 *  Copyright (c) 2020, The OpenThread Authors.
 *  All rights reserved.
 *
 *  Redistribution and use in source and binary forms, with or without
 *  modification, are permitted provided that the following conditions are met:
 *  1. Redistributions of source code must retain the above copyright
 *     notice, this list of conditions and the following disclaimer.
 *  2. Redistributions in binary form must reproduce the above copyright
 *     notice, this list of conditions and the following disclaimer in the
 *     documentation and/or other materials provided with the distribution.
 *  3. Neither the name of the copyright holder nor the
 *     names of its contributors may be used to endorse or promote products
 *     derived from this software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 *  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 *  IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 *  ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 *  LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 *  CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 *  SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 *  INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 *  CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 *  ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 *  POSSIBILITY OF SUCH DAMAGE.
 */

/**
 * @file
 *   This file implements the OpenThread platform abstraction for ToBLE communication.
 *
 */

#include <assert.h>
#include <stddef.h>
#include <stdint.h>
#include <string.h>

#include "platform-nrf5.h"
#include <openthread-core-config.h>
#include <openthread/config.h>

#include <openthread/platform/ble.h>
#include <openthread/platform/toble.h>
#include <openthread/platform/toolchain.h>

#include <common/logging.hpp>
#include <utils/code_utils.h>
#include <openthread/error.h>
#include <openthread/instance.h>

#include "nrf_sdh_ble.h"
#include "softdevice.h"

#include <common/logging.hpp>

#if OPENTHREAD_CONFIG_TOBLE_ENABLE && SOFTDEVICE_PRESENT

/**
 * The maximum number of charactertistics and descriptors returned via service discovery.
 *
 */
#define MAX_CHARACTERISTICS_COUNT 2
#define MAX_DESCRIPTORS_COUNT 2

#define UUID_SERVICE_GAP 0x1800
#define UUID_SERVICE_GATT 0x1801

/// Amount of time for exchanging packets each connection interval [units of 1.25 ms]
#define BLE_DEFAULT_CONNECTION_EVENT_LENGTH 320

/// Default BLE LL PDU size [bytes] (valid range: 27 to 251)
#define BLE_DEFAULT_PDU_SIZE 251

/// Default number of retries when no communication happens [units of connection interval]
#define BLE_DEFAULT_CONNECTION_RETRY 10

/// Default advertising handle
#ifndef BLE_DEFAULT_ADVERTISING_HANDLE
#define BLE_DEFAULT_ADVERTISING_HANDLE BLE_GAP_ADV_SET_HANDLE_NOT_SET
#endif

/// BLE time unit.
#define BLE_TIME_UNIT_USEC 625
#define USEC_PER_MSEC 1000

#define MS_TO_BLE_TIME_UNIT(ms) (((ms)*USEC_PER_MSEC) / BLE_TIME_UNIT_USEC)

#define BLE_CONNECTION_INTERVAL_UNIT 1250
#define MS_TO_BLE_CONNECTION_INTERVAL_UNIT(ms) (((ms)*USEC_PER_MSEC) / BLE_CONNECTION_INTERVAL_UNIT)

#define BLE_L2CAP_MTU 1000
#define BLE_L2CAP_PSM 0x90

/**
 * Macro to find the minimum of two values.
 */
#define MIN(a, b) ((a) < (b) ? (a) : (b))

/**
 * BLE Radio states.
 */
typedef enum
{
    kStateUninitialized,                 ///< BLE radio is uninitialized.
    kStateIdle,                          ///< BLE radio is in idle state.
    kStateAdvertising,                   ///< BLE radio advertising.
    kStateConnectionRequest,             ///< Connection request has been sent, and waiting for connection response.
    kStateGattiDiscoverUuidC1Handle,     ///<
    kStateGattiDiscoverUuidC2Handle,     ///<
    kStateGattiDiscoverUuidC2CccdHandle, ///<
    kStateGattSubscribing,               ///<
} BleState;

/**
 * BLE Control structure.
 */
typedef struct
{
    BleState              mState;                                      ///< Actual state of BLE Radio driver.
    ble_gap_conn_params_t mConnParams;                                 ///< Current connection parameters.
    ble_gap_adv_data_t    mAdvDataInfo;                                ///< GAP advertising data buffers info.
    uint8_t               mAdvData[BLE_GAP_ADV_SET_DATA_SIZE_MAX];     ///< GAP advertising data.
    uint8_t               mScanRspData[BLE_GAP_ADV_SET_DATA_SIZE_MAX]; ///< GAP scan response data.
    uint8_t               mAdvHandle;                                  ///< GAP advertising handle.
    uint8_t               mScanBuff[BLE_GAP_SCAN_BUFFER_MAX];          ///< GAP scanning buffer.
    uint16_t              mAdvInterval;                                ///< Advertising interval.
    otTobleAdvType        mAdvType;

    ble_gattc_handle_range_t mServiceHandleRange;

    uint16_t mC1Handle;
    uint16_t mC2Handle;
    uint16_t mC2CccdHandle;
} BleControl;

/**
 * BLE Peer structure.
 */
typedef struct
{
    bool     mIsUsed;       ///< Indicate if this structure is used.
    bool     mIsPeripheral; ///< Indicate if the peer is a peripheral.
    uint16_t mConnHandle;   ///< BLE GAP connection handle.
    uint16_t mAttMtu;       ///< Attribute MTU size.
    uint16_t mLocalCid;     ///< L2cap local CID.

    otTobleConnectionLinkType mLinkType; ///< Toble Link type.
} BlePeer;

/**
 *  Control BLE structre.
 */
static BleControl sBle;

/**
 *  BLE Peers structre.
 */
static BlePeer sBlePeers[NRF_SDH_BLE_TOTAL_LINK_COUNT];

static BlePeer *sPeripheralPeer;
static bool     sDiagMode;

/**
 * OpenThread instance.
 */
static otInstance *sInstance = NULL;

/**
 * Buffer for L2CAP SDU
 */
static uint8_t sL2capRxBuffer[BLE_DEFAULT_L2CAP_MAX_MTU_SIZE];

/**
 * Characteristic C1 UUID: 18EE2EF5-263D-4559-959F-4F9C429F9D11
 */
uint8_t sBtpUuidC1[] = {OT_PLAT_TOBLE_UUID_C1};

/**
 * Characteristic C2 UUID: 18EE2EF5-263D-4559-959F-4F9C429F9D12
 */
uint8_t sBtpUuidC2[] = {OT_PLAT_TOBLE_UUID_C2};

otPlatBleGattService sBtpServices[] = {
    {.mUuid   = {.mType = OT_BLE_UUID_TYPE_16, .mValue.mUuid16 = OT_PLAT_TOBLE_UUID_THREAD_GROUP},
     .mHandle = 0, ///< Set by bleGattServerServicesRegister
     .mCharacteristics =
         (otPlatBleGattCharacteristic[]){
             {.mUuid        = {.mType = OT_BLE_UUID_TYPE_128, .mValue.mUuid128 = sBtpUuidC1},
              .mHandleValue = 0, ///< Set by bleGattServerServicesRegister
              .mProperties  = OT_BLE_CHAR_PROP_WRITE | OT_BLE_CHAR_PROP_WRITE_NO_RESPONSE},
             {.mUuid        = {.mType = OT_BLE_UUID_TYPE_128, .mValue.mUuid128 = sBtpUuidC2},
              .mHandleValue = 0, ///< Set by bleGattServerServicesRegister
              .mProperties  = OT_BLE_CHAR_PROP_INDICATE | OT_BLE_CHAR_PROP_NOTIFY | OT_BLE_CHAR_PROP_READ},
             {
                 {0},               ///< No more characteristics in this service
                 .mHandleValue = 0, ///< Set by bleGattServerServicesRegister
             }}},
    {
        {0}, // No more services.
        .mHandle = 0,
    }};

static otError bleGattServerServicesRegister(otInstance *aInstance, otPlatBleGattService *aServices);

