wgtdkp/openthread/examples/platforms/nrf528xx/src/toble.c
static void peerInit(BlePeer *aPeer)
{
    memset(aPeer, 0, sizeof(BlePeer));
    aPeer->mConnHandle = BLE_CONN_HANDLE_INVALID;
    aPeer->mAttMtu     = BLE_GATT_ATT_MTU_DEFAULT;
}

/**
 * Gets the peer.
 */
static uint16_t peerGet(uint16_t aConnectionId)
{
    uint32_t index;

    for (index = 0; index < NRF_SDH_BLE_TOTAL_LINK_COUNT; index++)
    {
        if (sBlePeers[index].mConnHandle == aConnectionId)
        {
            break;
        }
    }

    return index;
}

/**
 * Returns number of connected peers.
 */
static uint32_t peerGetCount(void)
{
    uint32_t count = 0;

    for (uint32_t index = 0; index < NRF_SDH_BLE_TOTAL_LINK_COUNT; index++)
    {
        if (sBlePeers[index].mConnHandle != BLE_CONN_HANDLE_INVALID)
        {
            count++;
        }
    }

    return count;
}

/**
 * Allocates the new connection handle.
 */
static BlePeer *peerAllocate(void)
{
    uint16_t index = peerGet(BLE_CONN_HANDLE_INVALID);
    assert(index != NRF_SDH_BLE_TOTAL_LINK_COUNT);

    sBlePeers[index].mIsUsed = true;
    sBlePeers[index].mAttMtu = BLE_GATT_ATT_MTU_DEFAULT;

    return &sBlePeers[index];
}

static BlePeer *peerFind(uint16_t aConnectionId)
{
    uint32_t index;
    BlePeer *peer = NULL;

    for (index = 0; index < NRF_SDH_BLE_TOTAL_LINK_COUNT; index++)
    {
        if (sBlePeers[index].mConnHandle == aConnectionId)
        {
            peer = &sBlePeers[index];
            break;
        }
    }

    return peer;
}

/**
 * Frees the new connection handle.
 */
static void peerFree(uint16_t aConnectionId)
{
    uint16_t index = peerGet(aConnectionId);
    assert(index != NRF_SDH_BLE_TOTAL_LINK_COUNT);
    peerInit(&sBlePeers[index]);
}

/**
 *  Translates OpenThread's UUID type into SoftDevice's one.
 */
static uint32_t uuidDecode(ble_uuid_t *aSDUuid, const otPlatBleUuid *aOtUuid)
{
    uint32_t retval = NRF_SUCCESS;

    if (aOtUuid->mType == OT_BLE_UUID_TYPE_128)
    {
        otEXPECT_ACTION(aOtUuid->mValue.mUuid128 != NULL, retval = NRF_ERROR_INVALID_PARAM);

        retval = sd_ble_uuid_decode(OT_BLE_UUID_LENGTH, aOtUuid->mValue.mUuid128, aSDUuid);
    }
    else if (aOtUuid->mType == OT_BLE_UUID_TYPE_16)
    {
        aSDUuid->type = BLE_UUID_TYPE_BLE;
        aSDUuid->uuid = aOtUuid->mValue.mUuid16;
    }
    else
    {
        // 32-bit option is not supported.
        otEXPECT_ACTION(false, retval = NRF_ERROR_NOT_SUPPORTED);
    }

exit:
    return retval;
}

/**
 * Recognizes if handle is of CCCD type.
 */
static bool isCccdHandle(uint16_t aHandle)
{
    uint32_t retval;

    ble_uuid_t uuid;

    retval = sd_ble_gatts_attr_get(aHandle, &uuid, NULL);

    if (retval != NRF_SUCCESS)
    {
        otLogInfoPlat("[BLE]: sd_ble_gatts_attr_get error: 0x%x", retval);
    }
    else
    {
        if (uuid.type == BLE_UUID_TYPE_BLE && uuid.uuid == BLE_UUID_DESCRIPTOR_CLIENT_CHAR_CONFIG)
        {
            return true;
        }
    }

    return false;
}

/*******************************************************************************
 * @section Bluetooth Low Energy management.
 *******************************************************************************/

static void initState()
{
    uint32_t index;

    sBle.mState                        = kStateIdle;
    sBle.mConnParams.min_conn_interval = BLE_DEFAULT_CONNECTION_INTERVAL_MIN;
    sBle.mConnParams.max_conn_interval = BLE_DEFAULT_CONNECTION_INTERVAL_MAX;
    sBle.mConnParams.slave_latency     = BLE_DEFAULT_SLAVE_LATENCY;
    sBle.mConnParams.conn_sup_timeout  = BLE_DEFAULT_CONNECTIION_TIMEOUT;
    sBle.mAdvHandle                    = BLE_DEFAULT_ADVERTISING_HANDLE;

    for (index = 0; index < NRF_SDH_BLE_TOTAL_LINK_COUNT; index++)
    {
        peerInit(&sBlePeers[index]);
    }

    memset(&sBle.mAdvDataInfo, 0, sizeof(sBle.mAdvDataInfo));

    sPeripheralPeer = NULL;
    sDiagMode       = false;
}

void otPlatTobleInit(otInstance *aInstance)
{
    uint8_t isEnabled;

    sd_softdevice_is_enabled(&isEnabled);

    otEXPECT(((bool)isEnabled && (sBle.mState != kStateUninitialized)) == false);

    sInstance = aInstance;

    initState();
    bleGattServerServicesRegister(sInstance, sBtpServices);

#if OPENTHREAD_CONFIG_TOBLE_PERIPHERAL_ENABLE
    sBle.mC1Handle     = sBtpServices[0].mCharacteristics[0].mHandleValue;
    sBle.mC2Handle     = sBtpServices[0].mCharacteristics[1].mHandleValue;
    sBle.mC2CccdHandle = sBtpServices[0].mCharacteristics[1].mHandleCccd;
#endif

exit:
    return;
}

uint8_t otPlatTobleGetL2capPsm(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);
    return 0;
}

otTobleConnectionLinkType otPlatTobleGetConnectionLinkType(const otTobleConnection *aConn)
{
    BlePeer *peer = (BlePeer *)aConn;
    return peer->mLinkType;
}

bool otPlatTobleDiagModeGet(void)
{
    return sDiagMode;
}

void otPlatTobleDiagModeSet(otInstance *aInstance, bool aMode)
{
    OT_UNUSED_VARIABLE(aInstance);
    sDiagMode = aMode;
}

/*******************************************************************************
 * @section Bluetooth Low Energy GAP.
 *******************************************************************************/

otError bleGapAdvStart(otTobleAdvType aType, uint16_t aInterval)
{
    uint32_t             retval;
    ble_gap_adv_params_t params;

    memset(&params, 0, sizeof(ble_gap_adv_params_t));

    if (aType == OT_TOBLE_ADV_IND)
    {
        params.properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
    }
    else if (aType == OT_TOBLE_ADV_DIRECT_IND)
    {
        params.properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_NONSCANNABLE_DIRECTED_HIGH_DUTY_CYCLE;
    }
    else if (aType == OT_TOBLE_ADV_SCAN_IND)
    {
        params.properties.type = BLE_GAP_ADV_TYPE_NONCONNECTABLE_SCANNABLE_UNDIRECTED;
    }
    else if (aType == OT_TOBLE_ADV_NONCONN_IND)
    {
        params.properties.type = BLE_GAP_ADV_TYPE_NONCONNECTABLE_NONSCANNABLE_UNDIRECTED;
    }

    params.p_peer_addr   = NULL;
    params.filter_policy = BLE_GAP_ADV_FP_ANY;
    params.interval      = MS_TO_BLE_TIME_UNIT(aInterval);
    params.duration      = BLE_GAP_ADV_TIMEOUT_GENERAL_UNLIMITED;
    params.primary_phy   = BLE_GAP_PHY_1MBPS;

