wgtdkp/openthread/examples/platforms/nrf528xx/src/toble.c
    retval = sd_ble_l2cap_ch_setup(aPeer->mConnHandle, &aPeer->mLocalCid, &params);

    if (retval != NRF_SUCCESS)
    {
        otLogInfoPlat("[BLE]: sd_ble_l2cap_ch_setup error: 0x%x", retval);
    }

exit:
    return retval;
}

uint32_t bleL2capSendConnectionResponse(BlePeer *aPeer, otPlatBleL2capError aError, uint16_t aMtu)
{
    uint32_t                    retval;
    ble_l2cap_ch_setup_params_t params;

    otEXPECT_ACTION(aMtu <= BLE_DEFAULT_L2CAP_MAX_MTU_SIZE, retval = NRF_ERROR_INVALID_PARAM);

    otLogInfoPlat("otPlatBleL2capConnectionResponse mtu %d result %d", aMtu, aError);

    memset(&params, 0, sizeof(ble_l2cap_ch_setup_params_t));
    params.le_psm                   = 0x0055; // TODO: PSM here?
    params.status                   = aError;
    params.rx_params.rx_mtu         = aMtu;
    params.rx_params.rx_mps         = BLE_DEFAULT_L2CAP_MPS_SIZE;
    params.rx_params.sdu_buf.p_data = NULL;
    params.rx_params.sdu_buf.len    = 0;

    retval = sd_ble_l2cap_ch_setup(aPeer->mConnHandle, &aPeer->mLocalCid, &params);

    if (retval != NRF_SUCCESS)
    {
        otLogInfoPlat("[BLE]: sd_ble_l2cap_ch_setup error: 0x%x", retval);
    }

exit:
    return retval;
}

otError otPlatTobleL2capSend(otInstance *aInstance, otTobleConnection *aConn, const uint8_t *aBuffer, uint16_t aLength)
{
    BlePeer *  peer = (BlePeer *)aConn;
    uint32_t   retval;
    ble_data_t sduBuf;

    sduBuf.p_data = (uint8_t *)aBuffer;
    sduBuf.len    = aLength;

    retval = sd_ble_l2cap_ch_tx(peer->mConnHandle, peer->mLocalCid, &sduBuf);

    if (retval != NRF_SUCCESS)
    {
        otLogInfoPlat("[BLE]: sd_ble_l2cap_ch_tx error: 0x%x", retval);
    }

    return nrf5SdErrorToOtError(retval);
}

/*******************************************************************************
 * @section SoftDevice events.
 *******************************************************************************/

bool nrf5SoftDeviceBleIsEnabled()
{
    return sBle.mState != kStateUninitialized;
}

static otError advReportTypeConvert(ble_gap_adv_report_type_t aSdAdvType, otTobleAdvType *aTobleAdvType)
{
    otError error = OT_ERROR_NONE;

    if (aSdAdvType.connectable && aSdAdvType.scannable && !aSdAdvType.directed)
    {
        *aTobleAdvType = OT_TOBLE_ADV_IND;
    }
    else if (aSdAdvType.connectable && !aSdAdvType.scannable && aSdAdvType.directed)
    {
        *aTobleAdvType = OT_TOBLE_ADV_DIRECT_IND;
    }
    else if (!aSdAdvType.connectable && aSdAdvType.scannable && !aSdAdvType.directed)
    {
        *aTobleAdvType = OT_TOBLE_ADV_SCAN_IND;
    }
    else if (!aSdAdvType.connectable && !aSdAdvType.scannable && !aSdAdvType.directed)
    {
        *aTobleAdvType = OT_TOBLE_ADV_NONCONN_IND;
    }
    else
    {
        error = OT_ERROR_FAILED;
    }

    return error;
}

uint32_t bleGattcCharValueByUuidRead(uint16_t                  aConnectionId,
                                     ble_gattc_handle_range_t *aRange,
                                     const otPlatBleUuid *     aOtUuid)
{
    ble_uuid_t uuid;

    uuidDecode(&uuid, aOtUuid);
    return sd_ble_gattc_char_value_by_uuid_read(aConnectionId, &uuid, aRange);
}

static void ble_evt_handler(ble_evt_t const *aEvent, void *aContext)
{
    uint32_t   retval       = NRF_SUCCESS;
    ble_evt_t *evt          = (ble_evt_t *)aEvent;
    uint16_t   connectionId = evt->evt.common_evt.conn_handle;
    BlePeer *  peer;

    OT_UNUSED_VARIABLE(aContext);

    otEXPECT(nrf5SoftDeviceBleIsEnabled());

    if (evt->header.evt_id != BLE_GAP_EVT_ADV_REPORT)
    {
        otLogInfoPlat("[BLE] Event: 0x%x, conn_handle: 0x%x", evt->header.evt_id, connectionId);
    }

    switch (evt->header.evt_id)
    {
    case BLE_GAP_EVT_CONNECTED:
    {
        sBle.mState = kStateIdle;

        otLogInfoPlat("%s: Connected ConnectionId=%d", __func__, connectionId);

        peer = (sPeripheralPeer != NULL) ? sPeripheralPeer : peerAllocate();
        if (peer == NULL)
        {
            sd_ble_gap_disconnect(connectionId, OT_BLE_HCI_REMOTE_USER_TERMINATED);
            break;
        }

        peer->mConnHandle = connectionId;
        if (sDiagMode)
        {
            otPlatTobleDiagHandleConnected(sInstance, (otTobleConnection *)peer);
        }
        else
        {
            otPlatTobleHandleConnected(sInstance, (otTobleConnection *)peer);
        }

        if (sPeripheralPeer != NULL)
        {
            if (peer->mLinkType == kConnectionLinkTypeL2Cap)
            {
                otLogInfoPlat("[BLE]: bleL2capSendConnectionRequest, local_cid=%d", peer->mLocalCid);
                bleL2capSendConnectionRequest(peer, BLE_L2CAP_PSM, BLE_L2CAP_MTU);
            }
            else if (peer->mLinkType == kConnectionLinkTypeGatt)
            {
                otLogInfoPlat("[BLE]: sd_ble_gattc_exchange_mtu_request, local_cid=%d", peer->mLocalCid);
                sd_ble_gattc_exchange_mtu_request(peer->mConnHandle, peer->mAttMtu);
            }
        }

        ble_gap_data_length_params_t bleParams;

        // Clearing the struct will effectivly set members to @ref BLE_GAP_DATA_LENGTH_AUTO
        memset(&bleParams, 0, sizeof(ble_gap_data_length_params_t));
        bleParams.max_tx_octets = BLE_DEFAULT_PDU_SIZE;
        bleParams.max_rx_octets = BLE_DEFAULT_PDU_SIZE;

        otLogInfoPlat("[BLE]: Requesting data Length (tx, rx) octets = (%d, %d), time = (%d, %d) us",
                      bleParams.max_tx_octets, dleParams.max_rx_octets, dleParams.max_tx_time_us,
                      bleParams.max_rx_time_us);

        retval = sd_ble_gap_data_length_update(connectionId, &bleParams, NULL);

        if (retval != NRF_SUCCESS)
        {
            otLogInfoPlat("[BLE]: sd_ble_gap_data_length_update error: 0x%x", retval);
        }

        // Start reporting RSSI.
        retval = sd_ble_gap_rssi_start(connectionId, BLE_DEFAULT_RSSI_THRESHOLD_CHANGE, BLE_DEFAULT_RSSI_SKIP);

        if (retval != NRF_SUCCESS)
        {
            otLogInfoPlat("[BLE]: sd_ble_gap_rssi_start error: 0x%x", retval);
        }

        break;
    }

    case BLE_GAP_EVT_DISCONNECTED:
        otLogInfoPlat("BLE_GAP_EVT_DISCONNECTED ConnectionId=%d ", connectionId);

