wgtdkp/openthread/examples/platforms/nrf528xx/src/toble.c
        if ((peer = peerFind(connectionId)) != NULL)
        {
            sPeripheralPeer = NULL;
            if (sDiagMode)
            {
                otPlatTobleDiagHandleDisconnected(sInstance, (otTobleConnection *)peer);
            }
            else
            {
                otPlatTobleHandleDisconnected(sInstance, (otTobleConnection *)peer);
            }
        }

        // Free the BLE Peer slot.
        peerFree(connectionId);

        break;

    case BLE_GAP_EVT_CONN_PARAM_UPDATE:
    {
        ble_gap_conn_params_t *connParams = &evt->evt.gap_evt.params.conn_param_update.conn_params;

        retval = sd_ble_gap_conn_param_update(connectionId, connParams);

        if (retval != NRF_SUCCESS)
        {
            otLogInfoPlat("[BLE]: sd_ble_gap_conn_param_update error: 0x%x", retval);
        }

        break;
    }

    case BLE_GATTS_EVT_SYS_ATTR_MISSING:
        // No system attributes have been stored.
        retval = sd_ble_gatts_sys_attr_set(connectionId, NULL, 0, 0);

        break;

    case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
        // Pairing not supported
        retval = sd_ble_gap_sec_params_reply(connectionId, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);

        if (retval != NRF_SUCCESS)
        {
            otLogInfoPlat("[BLE]: sd_ble_gap_sec_params_reply error: 0x%x", retval);
        }

        break;

    case BLE_GAP_EVT_ADV_REPORT:
    {
        ble_gap_evt_adv_report_t *advReport = &evt->evt.gap_evt.params.adv_report;

        otTobleAdvPacket packet;
        ble_data_t       advData;

        packet.mRssi   = advReport->rssi;
        packet.mData   = advReport->data.p_data;
        packet.mLength = advReport->data.len;

        packet.mSrcAddress.mType = advReport->peer_addr.addr_type;
        memcpy(packet.mSrcAddress.mAddress, advReport->peer_addr.addr, OT_TOBLE_ADDRESS_SIZE);

        if (advReport->type.scan_response)
        {
            if (sDiagMode)
            {
                otPlatTobleDiagGapOnScanRespReceived(sInstance, &packet);
            }
            else
            {
                otPlatTobleGapOnScanRespReceived(sInstance, &packet);
            }
        }
        else
        {
            otTobleAdvType advType;

            if (advReportTypeConvert(advReport->type, &advType) == OT_ERROR_NONE)
            {
                if (sDiagMode)
                {
                    otPlatTobleDiagGapOnAdvReceived(sInstance, advType, &packet);
                }
                else
                {
                    otPlatTobleGapOnAdvReceived(sInstance, advType, &packet);
                }
            }
        }

        advData.p_data = sBle.mScanBuff;
        advData.len    = sizeof(sBle.mScanBuff);

        // Continue scanning.
        retval = sd_ble_gap_scan_start(NULL, &advData);
        if (retval != NRF_SUCCESS)
        {
            otLogInfoPlat("[BLE]: sd_ble_gap_sec_params_reply error: 0x%x", retval);
        }

        break;
    }

    case BLE_GAP_EVT_TIMEOUT:
        if (sBle.mState == kStateAdvertising)
        {
            bleGapAdvStart(sBle.mAdvType, sBle.mAdvInterval);
        }

        break;

    case BLE_GAP_EVT_RSSI_CHANGED:
        // Ignore.
        break;

    case BLE_GAP_EVT_DATA_LENGTH_UPDATE:
    {
        ble_gap_data_length_params_t *evtMtu = &evt->evt.gap_evt.params.data_length_update.effective_params;
        otLogInfoPlat("BLE_GAP_EVT_DATA_LENGTH_UPDATE Data Length is (tx, rx) octets = (%d, %d), time = (%d, %d) us",
                      evtMtu->max_tx_octets, evtMtu->max_rx_octets, evtMtu->max_tx_time_us, evtMtu->max_rx_time_us);
        UNUSED_PARAMETER(evtMtu);
        break;
    }

    case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST:
    {
        ble_gap_data_length_params_t bleParams;

        // Clearing the struct will effectivly set members to @ref BLE_GAP_DATA_LENGTH_AUTO
        memset(&bleParams, 0, sizeof(ble_gap_data_length_params_t));
        retval = sd_ble_gap_data_length_update(connectionId, &bleParams, NULL);

        otLogInfoPlat("[BLE]: Data Length requested is (tx, rx) octets = (%d, %d), time = (%d, %d) us",
                      bleParams.max_tx_octets, dleParams.max_rx_octets, dleParams.max_tx_time_us,
                      bleParams.max_rx_time_us);

        if (retval != NRF_SUCCESS)
        {
            otLogInfoPlat("[BLE]: sd_ble_gap_data_length_update error: 0x%x", retval);
        }

        break;
    }

    case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST:
    {
        uint16_t                              mtuMax = OT_BLE_ATT_MTU_MAX;
        ble_gatts_evt_exchange_mtu_request_t *evtMtu = &evt->evt.gatts_evt.params.exchange_mtu_request;

        otLogInfoPlat("BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST, mtuMax=%d, client_rx_mtu=%d", mtuMax, evtMtu->client_rx_mtu);
        if ((peer = peerFind(connectionId)) != NULL)
        {
            peer->mAttMtu = MIN(mtuMax, evtMtu->client_rx_mtu);

            if (sd_ble_gatts_exchange_mtu_reply(connectionId, peer->mAttMtu) != NRF_SUCCESS)
            {
                otLogInfoPlat("[BLE]: sd_ble_gatts_exchange_mtu_reply error: 0x%x", retval);
            }
        }

        break;
    }

    case BLE_GATTS_EVT_WRITE:
    {
        ble_gatts_evt_write_t *evtWrite = &evt->evt.gatts_evt.params.write;
        otBleRadioPacket       packet;
        uint8_t                channel_index;

        retval = sd_ble_gap_rssi_get(connectionId, &packet.mPower, &channel_index);

        if (retval != NRF_SUCCESS)
        {
            otLogInfoPlat("[BLE]: sd_ble_gap_rssi_get error: 0x%x", retval);
            packet.mPower = 0;
        }

        packet.mValue  = evtWrite->data;
        packet.mLength = evtWrite->len;

        if ((peer = peerFind(connectionId)) != NULL)
        {
            peer->mLinkType = kConnectionLinkTypeGatt;

            if (packet.mLength == 2 && isCccdHandle(evtWrite->handle))
            {
                uint16_t cccd = packet.mValue[0] | (packet.mValue[1] << 8);

                if (sDiagMode)
                {
                    otPlatTobleDiagHandleC2Subscribed(sInstance, (otTobleConnection *)peer,
                                                      cccd & BLE_GATT_HVX_INDICATION);
                }
                else
                {
                    otPlatTobleHandleC2Subscribed(sInstance, (otTobleConnection *)peer, cccd & BLE_GATT_HVX_INDICATION);
                }
            }
            else
            {
                if (sDiagMode)
                {
                    otPlatTobleDiagHandleC1Write(sInstance, (otTobleConnection *)peer, evtWrite->data, evtWrite->len);
                }
                else
                {
                    otPlatTobleHandleC1Write(sInstance, (otTobleConnection *)peer, evtWrite->data, evtWrite->len);
                }
            }
        }

        break;
    }

    case BLE_GATTS_EVT_HVC:
    {
        // ble_gatts_evt_hvc_t *evtHvc = &evt->evt.gatts_evt.params.hvc;

