wgtdkp/openthread/examples/platforms/nrf528xx/src/toble.c
        if ((peer = peerFind(connectionId)) != NULL)
        {
            if (sDiagMode)
            {
                otPlatTobleDiagHandleC2IndicateDone(sInstance, (otTobleConnection *)peer);
            }
            else
            {
                otPlatTobleHandleC2IndicateDone(sInstance, (otTobleConnection *)peer);
            }
        }
        break;
    }

    case BLE_GATTS_EVT_TIMEOUT:
        sd_ble_gap_disconnect(connectionId, OT_BLE_HCI_REMOTE_USER_TERMINATED);
        break;

    case BLE_GATTC_EVT_EXCHANGE_MTU_RSP:
    {
        ble_gattc_evt_exchange_mtu_rsp_t *evtMtu = &evt->evt.gattc_evt.params.exchange_mtu_rsp;

        if ((peer = peerFind(connectionId)) != NULL)
        {
            ble_uuid_t uuid;

            otLogInfoPlat("BLE_GATTC_EVT_EXCHANGE_MTU_RSP, mAttMtu=%d, server_rx_mtu=%d", peer->mAttMtu,
                          evtMtu->server_rx_mtu);

            peer->mAttMtu = MIN(peer->mAttMtu, evtMtu->server_rx_mtu);

            retval = uuidDecode(&uuid, &sBtpServices[0].mUuid);
            otEXPECT(retval == NRF_SUCCESS);

            otLogInfoPlat("sd_ble_gattc_primary_services_discover, ConnectionId=%d ", peer->mConnHandle);

            if (sd_ble_gattc_primary_services_discover(peer->mConnHandle, BLE_GATT_HANDLE_START, &uuid) != NRF_SUCCESS)
            {
                otLogInfoPlat("[BLE]: sd_ble_gattc_primary_services_discover error: 0x%x", retval);
            }
        }
        break;
    }

    case BLE_GATTC_EVT_TIMEOUT:
        sd_ble_gap_disconnect(connectionId, OT_BLE_HCI_REMOTE_USER_TERMINATED);
        break;

    case BLE_GATTC_EVT_HVX:
    {
        ble_gattc_evt_hvx_t *evtHvx = &evt->evt.gattc_evt.params.hvx;

        retval = sd_ble_gattc_hv_confirm(connectionId, evtHvx->handle);
        if (retval != NRF_SUCCESS)
        {
            otLogInfoPlat("[BLE]: sd_ble_gattc_hv_confirm error: 0x%x", retval);
        }

        if ((peer = peerFind(connectionId)) != NULL)
        {
            if (sDiagMode)
            {
                otPlatTobleDiagHandleC2Indication(sInstance, (otTobleConnection *)peer, evtHvx->data, evtHvx->len);
            }
            else
            {
                otPlatTobleHandleC2Indication(sInstance, (otTobleConnection *)peer, evtHvx->data, evtHvx->len);
            }
        }
        break;
    }

    case BLE_GATTC_EVT_WRITE_RSP:
    {
        // ble_gattc_evt_write_rsp_t *evtWrsp = &evt->evt.gattc_evt.params.write_rsp;

        if (sBle.mState == kStateGattSubscribing)
        {
            otLogInfoPlat("BLE_GATTC_EVT_WRITE_RSP: connectionId=%d handle=%d", connectionId, evtWrsp->handle);
        }
        else
        {
            if ((peer = peerFind(connectionId)) != NULL)
            {
                if (sDiagMode)
                {
                    otPlatTobleDiagHandleC1WriteDone(sInstance, (otTobleConnection *)peer);
                }
                else
                {
                    otPlatTobleHandleC1WriteDone(sInstance, (otTobleConnection *)peer);
                }
            }
        }

        sBle.mState = kStateIdle;

        break;
    }

    case BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP:
    {
        ble_gattc_evt_prim_srvc_disc_rsp_t *evtDisc = &evt->evt.gattc_evt.params.prim_srvc_disc_rsp;

        if (evtDisc->count == 1)
        {
            sBle.mServiceHandleRange = evtDisc->services[0].handle_range;
            sBle.mState              = kStateGattiDiscoverUuidC1Handle;

            otLogInfoPlat("BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP, start_handle=%d end_handle=%d",
                          sBle.mServiceHandleRange.start_handle, sBle.mServiceHandleRange.end_handle);
            bleGattcCharValueByUuidRead(connectionId, &sBle.mServiceHandleRange,
                                        &sBtpServices[0].mCharacteristics[0].mUuid);
        }
        else
        {
            otLogInfoPlat("BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP, Not Found");
        }

        break;
    }
    case BLE_GATTC_EVT_CHAR_VAL_BY_UUID_READ_RSP:
    {
        ble_gattc_evt_char_val_by_uuid_read_rsp_t *evtDisc = &evt->evt.gattc_evt.params.char_val_by_uuid_read_rsp;

        if (sBle.mState == kStateGattiDiscoverUuidC1Handle)
        {
            otLogInfoPlat("BLE_GATTC_EVT_CHAR_VAL_BY_UUID_READ_RSP, count=%d value_len=%d UuidC1Handle=%d",
                          evtDisc->count, evtDisc->value_len, evtDisc->handle_value[0]);
            sBle.mState    = kStateGattiDiscoverUuidC2Handle;
            sBle.mC1Handle = evtDisc->handle_value[0];

            bleGattcCharValueByUuidRead(connectionId, &sBle.mServiceHandleRange,
                                        &sBtpServices[0].mCharacteristics[1].mUuid);
        }
        else if (sBle.mState == kStateGattiDiscoverUuidC2Handle)
        {
            otPlatBleUuid uuid = {.mType = OT_BLE_UUID_TYPE_16, .mValue.mUuid16 = OT_BLE_UUID_CCCD};

            otLogInfoPlat("BLE_GATTC_EVT_CHAR_VAL_BY_UUID_READ_RSP, count=%d value_len=%d UuidC2Handle=%d",
                          evtDisc->count, evtDisc->value_len, evtDisc->handle_value[0]);
            sBle.mState    = kStateGattiDiscoverUuidC2CccdHandle;
            sBle.mC2Handle = evtDisc->handle_value[0];

            bleGattcCharValueByUuidRead(connectionId, &sBle.mServiceHandleRange, &uuid);
        }
        else if (sBle.mState == kStateGattiDiscoverUuidC2CccdHandle)
        {
            otLogInfoPlat("BLE_GATTC_EVT_CHAR_VAL_BY_UUID_READ_RSP, count=%d value_len=%d UuidC2CccdHandle=%d",
                          evtDisc->count, evtDisc->value_len, evtDisc->handle_value[0]);
            sBle.mC2CccdHandle = evtDisc->handle_value[0];

            if ((peer = peerFind(connectionId)) != NULL)
            {
                sPeripheralPeer = NULL;
                if (sDiagMode)
                {
                    otPlatTobleDiagHandleConnectionIsReady(sInstance, (otTobleConnection *)peer, peer->mLinkType);
                }
                else
                {
                    otPlatTobleHandleConnectionIsReady(sInstance, (otTobleConnection *)peer, peer->mLinkType);
                }
            }
        }

        break;
    }

    case BLE_L2CAP_EVT_CH_SETUP_REQUEST:
    {
        ble_l2cap_evt_t *                 l2capEvt       = &evt->evt.l2cap_evt;
        ble_l2cap_evt_ch_setup_request_t *chSetupRequest = &evt->evt.l2cap_evt.params.ch_setup_request;

